tenant_template_esbinput/api_deploy/api__deploy__tenant__addUser.xml

<@pp.dropOutputFile />
<@pp.changeOutputFile name="api__deploy__"+tenant.code+"__addUser.xml"/>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd" xmlns:xsd1="http://common.mgt.user.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:addUser>
         <xsd:userName>__user__</xsd:userName>
         <xsd:password>__password__</xsd:password>
         <xsd:roles>mb-topic-write-input.${tenant.code}</xsd:roles>         
      </xsd:addUser>
   </soapenv:Body>
</soapenv:Envelope>
